app/views/breweries/show.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  ORDER BY id desc  [["brewery_id", 1]]
---

<% Beer.where(brewery_id: @brewery.id).order('id desc').each do |beer| %>