app/views/beers/index.html.erb

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
---
      <td>
    	<%= link_to Brewery.find_by(id: beer.brewery.id).name, "/breweries/#{beer.brewery_id}" %>