app/views/beers/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = 12  ORDER BY id desc
---

<% Rating.where(beer_id: @beer.id).order('id desc').each do |rating| %>