app/views/beers/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  ORDER BY created desc  [["beer_id", 96]]
---
<table class="table table-striped table-bordered">
<% Rating.where(beer_id: @beer.id).order('created desc').each do |rating| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
    <strong><%= ("&#9733;" * rating.stars).html_safe  %></strong>
    <% user = User.find_by(id: rating.user) %><br>