app/controllers/beers_controller.rb

  def find_beer
    @beer= Beer.find_by(id: params["id"])
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", 19]]

  def new
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    @brewery = Brewery.find_by(id: params[:brewery])
    @beer = Beer.new(name: params[:name], image_url: params[:image_url], description: params[:description], brewery: @brewery, created: DateTime.now)
    if @beer.valid?
      redirect_to root_url, notice:"Created beer " + params[:name]
      @beer.save
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "beers" ("name", "image_url", "description", "brewery_id") VALUES (?, ?, ?, ?)  [["name", "abc"], ["image_url", "s"], ["description", "s"], ["brewery_id", 2]]

  def update
    @beer.update name: params[:name],
                 image_url: params[:image_url],
                 description: params[:description]
---
UPDATE "beers" SET "image_url" = ? WHERE "beers"."id" = ?  [["image_url", "http://cdn.beeradvocate.com/im/beers/74986.jpgaaaaaaaa"], ["id", 28]]

  def destroy
    Beer.delete(params[:id])
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 18]]