app/controllers/breweries_controller.rb

   def find_brewery
     @brewery= Brewery.find_by(id: params["id"])
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @breweries = Brewery.limit(200).page(params[:page]).per(20)
---
SELECT "breweries".* FROM "breweries"

  def create
    @brewery = Brewery.new(name: params[:name], created: params[:created], description: params[:description], created: DateTime.now)
    if @brewery.valid?
      redirect_to "/breweries/", notice:"Added brewery " + params[:name]
      @brewery.save
---
INSERT INTO "breweries" ("name") VALUES (?)  [["name", "sss"]]

  def destroy
    Brewery.delete(params[:id])
---
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 5]]