app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("description", "beer_id", "stars", "user_id") VALUES (?, ?, ?, ?)  [["description", "aaaaaah"], ["beer_id", 96], ["stars", 5], ["user_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
  def create
    Rating.create description: params[:description], beer_id: params[:beer_id], stars: params[:stars], user: User.find_by(id: session[:user_id]), created: DateTime.now