app/controllers/users_controller.rb

  def create
    @user = User.new(username: params[:username], image_url: params[:image_url], bio: params[:bio], password: params[:password], email: params[:email])
    if @user.valid?
      redirect_to root_url, notice:"Welcome to Beer Picker " + params[:username]
        @user.save
---
INSERT INTO "users" ("username", "image_url", "bio", "password") VALUES (?, ?, ?, ?)  [["username", "aaa"], ["image_url", ""], ["bio", ""], ["password", "aaa"]]

  def edit
    @user = User.find_by(id: cookies['current_user'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @user = User.find(params[:id])
    @user.update username: params[:username],
                 image_url: params[:image_url],
                 bio: params[:bio],
    password: params[:password]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "users" SET "username" = ?, "image_url" = ? WHERE "users"."id" = ?  [["username", "aaa2"], ["image_url", ""], ["id", 8]]